Revit 2027 API
Alignment.GetClosestStation Method
 Calculates the alignment station closest to the given model point.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetClosestStation(
	XYZ point
)
Public Function GetClosestStation (
	point As XYZ
) As Double
public:
double GetClosestStation(
	XYZ^ point
)
member GetClosestStation :
        point : XYZ -> float
Parameters
point XYZ
The model point for which to calculate the closest station.
Return Value
Double
The alignment station closest to the given model point, in Revit internal model units (standard Imperial feet).
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace